docs/errors/index.org
#+TITLE: Simple Domain Modeling Language
#+SUBTITLE: Language Error Codes
#+AUTHOR: Simon Johnston
#+EMAIL: johnstonskj@gmail.com
#+LANGUAGE: en
#+STARTUP: overview hidestars inlineimages entitiespretty
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../rtd-sdml.css"/>
#+OPTIONS: toc:3


#+BEGIN_SRC emacs-lisp :exports none
(require 'ebnf-mode)
(require 'ob-sdml)
#+END_SRC

This page provides a reference to the errors, warnings, and informational messages defined in the =sdml_error= crate and
output by the =sdml= command-line tool.

* Bugs

This category represents bugs in the command-line tool where it's parser receives unexpected nodes from the underlying
tree-sitter parser.

** B0001: Tree-Sitter Error Node
:PROPERTIES:
:CUSTOM_ID: B0001
:END:

If the tree-sitter parser itself cannot parse some content it inserts an =error= node in the tree. When the SDML parser
encounters such a node it is clearly a defect in the underlying source, but we don't yet know what.

The =Diagnostic= for this error will attempt to record the file ID, location, and the name of any rule the parser was
processing when the error node was found.

*** Example

#+CAPTION: Example Module
#+NAME: lst:b0001-module
#+BEGIN_SRC sdml :exports code :eval never
module example <https://example.com/api> version "" is
  ; missing the version URI, error here  ----------^
end
#+END_SRC

#+CAPTION: Validation Output
#+NAME: lst:b0001-output
#+BEGIN_EXAMPLE
bug[B0001]: tree-sitter parse error encountered
  ┌─ examples/errors/b0002.sdm:1:1
  │  
1 │ ╭ module example <https://example.com/api> version "" is
2 │ │   ; missing the version URI, error here  ----------^
3 │ │ end
4 │ │ 
  │ ╰^ here
  │  
  = in grammar rule: `module`
  = help: encountered a tree-sitter ERROR node in the parse tree
  = help: for more details, see <https://sdml.io/errors/#B0002>  

bug: parser generated 1 bugs.
#+END_EXAMPLE

** B0002: Tree-Sitter Unexpected Node
:PROPERTIES:
:CUSTOM_ID: B0002
:END:

The =Diagnostic= for this error will attempt to record the file ID, location, and the name of any expected nodes along
with the name of the node found.

*** Example

#+CAPTION: Example Module
#+NAME: lst:b0003-module
#+BEGIN_SRC sdml :exports code :eval never
#+END_SRC

#+CAPTION: Validation Output
#+NAME: lst:b0003-output
#+BEGIN_EXAMPLE
#+END_EXAMPLE

** B0003: Tree-Sitter Missing Node
:PROPERTIES:
:CUSTOM_ID: B0003
:END:

The =Diagnostic= for this error will attempt to record the file ID, location, and the name of any expected nodes along
with the name of any variable that might have contained the expected node.

*** Example

#+CAPTION: Example Module
#+NAME: lst:b0003-module
#+BEGIN_SRC sdml :exports code :eval never
#+END_SRC

#+CAPTION: Validation Output
#+NAME: lst:b0003-output
#+BEGIN_EXAMPLE
#+END_EXAMPLE

** B0004: Tree-Sitter Missing Variable
:PROPERTIES:
:CUSTOM_ID: B0004
:END:

The =Diagnostic= for this error will attempt to record the file ID, location, and the name of the expected variable along
with the name of the node kind that should have contained the expected variable.

*** Example

#+CAPTION: Example Module
#+NAME: lst:b0004-module
#+BEGIN_SRC sdml :exports code :eval never
#+END_SRC

#+CAPTION: Validation Output
#+NAME: lst:b0004-output
#+BEGIN_EXAMPLE
#+END_EXAMPLE


* Errors

This category represents errors in module loading, in parsing a complete tree-sitter tree, or in module validation.

** E0100: Module Not Found
:PROPERTIES:
:CUSTOM_ID: E0100
:END:

An attempt to load a module failed, specifically a module that was loaded directly, not from another module's import
statements.

