docs/errors/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-20 Tue 09:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simple Domain Modeling Language</title>
<meta name="author" content="Simon Johnston" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../rtd-sdml.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Simple Domain Modeling Language
<br />
<span class="subtitle">Language Error Codes</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org94fe747">1. Bugs</a>
<ul>
<li><a href="#B0001">1.1. B0001: Tree-Sitter Error Node</a>
<ul>
<li><a href="#org5ade850">1.1.1. Example</a></li>
</ul>
</li>
<li><a href="#B0002">1.2. B0002: Tree-Sitter Unexpected Node</a>
<ul>
<li><a href="#org33fc6ab">1.2.1. Example</a></li>
</ul>
</li>
<li><a href="#B0003">1.3. B0003: Tree-Sitter Missing Node</a>
<ul>
<li><a href="#org57dd6e0">1.3.1. Example</a></li>
</ul>
</li>
<li><a href="#B0004">1.4. B0004: Tree-Sitter Missing Variable</a>
<ul>
<li><a href="#orga3d73ce">1.4.1. Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1ce9628">2. Errors</a>
<ul>
<li><a href="#E0100">2.1. E0100: Module Not Found</a>
<ul>
<li><a href="#orgba00fbc">2.1.1. Example</a></li>
</ul>
</li>
<li><a href="#E0101">2.2. E0101: Imported Module Not Found</a>
<ul>
<li><a href="#org1ab7507">2.2.1. Example</a></li>
</ul>
</li>
<li><a href="#E0102">2.3. E0102: Module Version Not Found</a>
<ul>
<li><a href="#org5c329eb">2.3.1. Example</a></li>
</ul>
</li>
<li><a href="#E0103">2.4. E0103: Module Version Mismatch</a>
<ul>
<li><a href="#orgcd85ac6">2.4.1. Example</a></li>
</ul>
</li>
<li><a href="#E0104">2.5. E0104: Duplicate Definition Name</a>
<ul>
<li><a href="#org6574a77">2.5.1. Example</a></li>
</ul>
</li>
<li><a href="#E0105">2.6. E0105: Duplicate Member Name</a>
<ul>
<li><a href="#org941300e">2.6.1. Example</a></li>
</ul>
</li>
<li><a href="#E0106">2.7. E0106: Duplicate Variant Name</a>
<ul>
<li><a href="#orge206f99">2.7.1. Example Value Variant</a></li>
<li><a href="#org6115740">2.7.2. Example Type Variant</a></li>
<li><a href="#orge2cc1d0">2.7.3. Example Type Variant Rename</a></li>
</ul>
</li>
<li><a href="#E0107">2.8. E0107: Invalid Identifier</a>
<ul>
<li><a href="#orgb84afe7">2.8.1. Example</a></li>
</ul>
</li>
<li><a href="#E0108">2.9. E0108: Invalid Language Tag</a>
<ul>
<li><a href="#org0a028d0">2.9.1. Example</a></li>
</ul>
</li>
<li><a href="#E0109">2.10. E0109: Invalid Value For Type</a>
<ul>
<li><a href="#org8455c26">2.10.1. Example</a></li>
</ul>
</li>
<li><a href="#E0110">2.11. E0110: Invalid Module Base Url</a>
<ul>
<li><a href="#orgc558a61">2.11.1. Example</a></li>
</ul>
</li>
<li><a href="#E0112">2.12. E0112: Invalid Module Version Url</a>
<ul>
<li><a href="#org871bf9f">2.12.1. Example</a></li>
</ul>
</li>
<li><a href="#E0113">2.13. E0113: Definition Not Found</a>
<ul>
<li><a href="#org4ebc84d">2.13.1. Example</a></li>
</ul>
</li>
<li><a href="#E0114">2.14. E0114: Type Definition Not Found</a>
<ul>
<li><a href="#org3664c2a">2.14.1. Example</a></li>
</ul>
</li>
<li><a href="#E0115">2.15. E0115: Datatype Invalid Base</a>
<ul>
<li><a href="#org01d3e78">2.15.1. Example</a></li>
</ul>
</li>
<li><a href="#E0116">2.16. E0116: Type Class Incompatible</a>
<ul>
<li><a href="#orga31e2a5">2.16.1. Example</a></li>
</ul>
</li>
<li><a href="#E0117">2.17. E0117: Property Incompatible</a>
<ul>
<li><a href="#org8770079">2.17.1. Example</a></li>
</ul>
</li>
<li><a href="#E0118">2.18. E0118: RDF Definition Incompatible</a>
<ul>
<li><a href="#orgbf1a966">2.18.1. Example</a></li>
</ul>
</li>
<li><a href="#E0119">2.19. E0119: Feature Set Not a Union</a>
<ul>
<li><a href="#org8257649">2.19.1. Example</a></li>
</ul>
</li>
<li><a href="#E0120">2.20. E0120: Property Reference Not a Property</a>
<ul>
<li><a href="#org43f5ea5">2.20.1. Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5923e12">3. Warnings</a>
<ul>
<li><a href="#W0301:">3.1. W0301: Module Already Imported</a>
<ul>
<li><a href="#orgb74594b">3.1.1. Example</a></li>
</ul>
</li>
<li><a href="#W0302">3.2. W0302: Member Already Imported</a>
<ul>
<li><a href="#org6dd4567">3.2.1. Example</a></li>
</ul>
</li>
<li><a href="#W0303">3.3. W0303: Validation Incomplete</a>
<ul>
<li><a href="#orgfe10146">3.3.1. Example</a></li>
</ul>
</li>
<li><a href="#W0304">3.4. W0304: Module Version Info Empty</a>
<ul>
<li><a href="#orgfabe7ef">3.4.1. Example</a></li>
</ul>
</li>
<li><a href="#W0305">3.5. W0305: Deprecated Term Used</a>
<ul>
<li><a href="#org75a231d">3.5.1. Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org193139c">4. Informational</a>
<ul>
<li><a href="#I0500:">4.1. I0500: Incomplete Module</a>
<ul>
<li><a href="#org0d80c94">4.1.1. Example</a></li>
</ul>
</li>
<li><a href="#I0501:">4.2. I0501: Incomplete Definition</a>
<ul>
<li><a href="#orgd58d358">4.2.1. Example</a></li>
</ul>
</li>
<li><a href="#I0502">4.3. I0502: Incomplete Member</a>
<ul>
<li><a href="#org0131f91">4.3.1. Example</a></li>
</ul>
</li>
<li><a href="#I0503">4.4. I0503: String Without Language</a>
<ul>
<li><a href="#org678c86b">4.4.1. Example</a></li>
</ul>
</li>
<li><a href="#I0504">4.5. I0504: Unconstrained Datatype</a>
<ul>
<li><a href="#org9361875">4.5.1. Example</a></li>
</ul>
</li>
<li><a href="#I0505">4.6. I0505: Double Underscored Identifier</a>
<ul>
<li><a href="#orgb393fe7">4.6.1. Example</a></li>
</ul>
</li>
<li><a href="#I0506">4.7. I0506: Identifier Not Preferred Case</a>
<ul>
<li><a href="#org8c36723">4.7.1. Example</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This page provides a reference to the errors, warnings, and informational messages defined in the <code>sdml_error</code> crate and
output by the <code>sdml</code> command-line tool.
</p>

<div id="outline-container-org94fe747" class="outline-2">
<h2 id="org94fe747"><span class="section-number-2">1.</span> Bugs</h2>
<div class="outline-text-2" id="text-1">
<p>
This category represents bugs in the command-line tool where it&rsquo;s parser receives unexpected nodes from the underlying
tree-sitter parser.
</p>
</div>

<div id="outline-container-B0001" class="outline-3">
<h3 id="B0001"><span class="section-number-3">1.1.</span> B0001: Tree-Sitter Error Node</h3>
<div class="outline-text-3" id="text-B0001">
<p>
If the tree-sitter parser itself cannot parse some content it inserts an <code>error</code> node in the tree. When the SDML parser
encounters such a node it is clearly a defect in the underlying source, but we don&rsquo;t yet know what.
</p>

<p>
The <code>Diagnostic</code> for this error will attempt to record the file ID, location, and the name of any rule the parser was
processing when the error node was found.
</p>
</div>

<div id="outline-container-org5ade850" class="outline-4">
<h4 id="org5ade850"><span class="section-number-4">1.1.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Example Module</label><pre class="src src-sdml" id="org121e68c"><span style="color: #859900;">module</span> <span style="color: #268bd2;">example</span> <span style="color: #2aa198; font-weight: bold;"><a href="https://example.com/api">&lt;https://example.com/api&gt;</a></span> version "" <span style="color: #859900;">is</span>
  <span style="color: #93a1a1; font-style: italic;">; missing the version URI, error here  ----------^</span>
<span style="color: #859900;">end</span>
</pre>
</div>

<pre class="example" id="org0553fb0">
bug[B0001]: tree-sitter parse error encountered
  ┌─ examples/errors/b0002.sdm:1:1
  │  
1 │ ╭ module example &lt;https://example.com/api&gt; version "" is
2 │ │   ; missing the version URI, error here  ----------^
3 │ │ end
4 │ │ 
  │ ╰^ here
  │  
  = in grammar rule: `module`
  = help: encountered a tree-sitter ERROR node in the parse tree
  = help: for more details, see &lt;https://sdml.io/errors/#B0002&gt;  

bug: parser generated 1 bugs.
</pre>
</div>
</div>
</div>

<div id="outline-container-B0002" class="outline-3">
<h3 id="B0002"><span class="section-number-3">1.2.</span> B0002: Tree-Sitter Unexpected Node</h3>
<div class="outline-text-3" id="text-B0002">
<p>
The <code>Diagnostic</code> for this error will attempt to record the file ID, location, and the name of any expected nodes along
with the name of the node found.
</p>
</div>

<div id="outline-container-org33fc6ab" class="outline-4">
<h4 id="org33fc6ab"><span class="section-number-4">1.2.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Example Module</label><pre class="src src-sdml" id="org5c00899">
</pre>
</div>

<pre class="example" id="orgc7cdd37">

</pre>
</div>
</div>
</div>

<div id="outline-container-B0003" class="outline-3">
<h3 id="B0003"><span class="section-number-3">1.3.</span> B0003: Tree-Sitter Missing Node</h3>
<div class="outline-text-3" id="text-B0003">
<p>
The <code>Diagnostic</code> for this error will attempt to record the file ID, location, and the name of any expected nodes along
with the name of any variable that might have contained the expected node.
</p>
</div>

<div id="outline-container-org57dd6e0" class="outline-4">
<h4 id="org57dd6e0"><span class="section-number-4">1.3.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Example Module</label><pre class="src src-sdml" id="orgd08511b">
</pre>
</div>

<pre class="example" id="org1308765">

</pre>
</div>
</div>
</div>

<div id="outline-container-B0004" class="outline-3">
<h3 id="B0004"><span class="section-number-3">1.4.</span> B0004: Tree-Sitter Missing Variable</h3>
<div class="outline-text-3" id="text-B0004">
<p>
The <code>Diagnostic</code> for this error will attempt to record the file ID, location, and the name of the expected variable along
with the name of the node kind that should have contained the expected variable.
</p>
</div>

<div id="outline-container-orga3d73ce" class="outline-4">
<h4 id="orga3d73ce"><span class="section-number-4">1.4.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Example Module</label><pre class="src src-sdml" id="orgbb9970f">
</pre>
</div>

<pre class="example" id="org0dbf718">

</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org1ce9628" class="outline-2">
<h2 id="org1ce9628"><span class="section-number-2">2.</span> Errors</h2>
<div class="outline-text-2" id="text-2">
<p>
This category represents errors in module loading, in parsing a complete tree-sitter tree, or in module validation.
</p>
</div>

<div id="outline-container-E0100" class="outline-3">
<h3 id="E0100"><span class="section-number-3">2.1.</span> E0100: Module Not Found</h3>
<div class="outline-text-3" id="text-E0100">
<p>
An attempt to load a module failed, specifically a module that was loaded directly, not from another module&rsquo;s import
statements.
</p>
</div>
